[{"title":"新的开始","date":"2017-08-31T13:32:57.000Z","path":"2017/08/31/新的开始/","text":"今天是开学第二天，经过大学最后一个暑假的糙磨之后终于迎来了开学，虽然还是我的内蒙古大学，虽然还是计算机学院，但是我对新的开始还是充满了向往。 今年是自治区70周年大庆，内蒙古大学60周年大庆，计算机学院20周年庆，从年初开始呼市就各种修，用欣欣向荣形容这一切可能太过于文雅，暑假之后回来之后确实感觉呼市大变样，花花草草变多了，乱七八糟的广告牌子也整理的比较顺眼了，学校里面更是没得说，最起码有好几段路比原来平整多了。 这两天给我最大的感触就是物是人非，同学们都各奔前程了，学校还是老样子，桃李湖风景依旧。28号的时候来学校这边逛了一圈，偶然遇见了之惠姐姐来学校取档案，还是像往常一样的跟惠姐打了个招呼，聊了几句之后就道别了，但是就在说再见的那一刻才意识到，以后这样的见面的机会也许只能交给缘分了。原来我们真的已经毕业了。 宿舍从本区搬到了东区，原来的六人间变成了四人间。新宿舍上床下桌的环境还是很令人心喜的，宿舍楼底下还有篮球场，虽然没上场打一会，但是只是静静的站在旁边看一会就很令人心满意足了，还有好多学生在灯下玩滑板，还有校园广播中持续不断的流行歌曲，还有好多好多好多好多值得分享的东西。。。。 本科的时候很喜欢跟舍友网吧五连坐，大家一起(｡･∀･)ﾉﾞ嗨，一起玩就感觉很棒，现在更喜欢一个人静静的坐着，听会歌，看看风景，难道是因为我老了？可能只是心气不一样了吧，也可能是因为现在不是很容易找齐5个人再到网吧坐会了吧。 最近最不能释怀的还是我的狼人杀小分队，虽然大家在一起的时光不是很长，但是革命友谊胜过一切，大家一起谈天说地，一起打大A，当然最有意思的狼人杀，还是很怀念那几天的游戏气氛，很棒。还有最后一句，我是预言家（手动滑稽）。 这两天见了导师，认识了新的同学，买了新装备，感觉还是棒棒哒。 明天就是开学典礼了，希望明天又是美好的一天。","tags":[{"name":"随笔","slug":"随笔","permalink":"http://cliugeek9229.github.io/tags/随笔/"}]},{"title":"git-常用命令总结","date":"2017-06-26T02:49:21.000Z","path":"2017/06/26/git-常用命令总结/","text":"&gt;","tags":[{"name":"学习总结","slug":"学习总结","permalink":"http://cliugeek9229.github.io/tags/学习总结/"}]},{"title":"git 学习总结（三）","date":"2017-06-23T10:07:00.000Z","path":"2017/06/23/git-学习总结3/","text":"关于git本地工作的操作以及知识点已经总结的差不多了，这篇博客主要是总结关于远程仓库的。 git服务器到目前为止，我还没尝试着搭建，不是说这个东西不重要，主要是我现在还没涉及到商业性质的代码，就我现在写的代码还不足以藏起来不分享，大家都挺忙的，谁有闲工夫来破译我写的烂代码啊~~~既然自己不想搭建个人的git服务器，那么我们就可以用github–一个神奇的网站，负责git仓库托管服务的。 下面开始介绍github的使用,开始之前你需要自行注册一个github的账户。 1.首先本地的git仓库和github仓库之间的传输是通过SSH加密的。","tags":[{"name":"学习心得","slug":"学习心得","permalink":"http://cliugeek9229.github.io/tags/学习心得/"}]},{"title":"git 学习总结（二）","date":"2017-06-21T01:09:19.000Z","path":"2017/06/21/git-学习总结2/","text":"没错，这是接着上一次的博客写的。 1.上次说到了日志查看操作，后来在评论区看到了git reflog 命令。 git会记录你的每一次修改HEAD的操作，通过git reflog可以查看所有的历史操作记录，它等同于git log -g 命令。git log命令会显示你所有的提交记录，仅是commit，而git reflog是显示所有操作记录，还包括checkout、merge和reset记录。 2.现在我们既然会查看了，那么接下来就是版本回退了。命令如下： 回退到当前版本的上一个版本 $ git reset –hard HEAD^ 回退到当前版本的上两个版本 $ git reset –hard HEAD^^ 可能机智的你发现了这个^的作用，但是问题又来了，比如你想回到前100个版本，你不会想打100个^吧，这得多虐。那么简便方式来了： $ git reset –hard HEAD~100 其实我们也可以不必数需要回退的版本是当前版本的前多少个版本，通过指定版本号也可以会回退到指定的版本： $ git reset –hard 1234567890 没错，版本号就是你通过git log可以查看到的那串超长的乱七八糟的十六进制数，还有，就是这个版本号写前几位就行，没必要写全，但是也不能太短，能让系统识别出来是哪个版本就行，长度自己斟酌就好。 可能大家会对这个 –hard 参数有疑问，没有？那同学你就太没灵性了。就当大家都有疑问，那这个参数的作用是什么？ 答：git reset操作是撤销了你做的更改，但是除了当前分支上的操作，你可能还需要传入一些标记来修改你的缓存区或工作目录，所以： –soft – 缓存区和工作目录都不会被改变 –mixed – 默认选项。缓存区和你指定的提交同步，但工作目录不受影响 –hard – 缓存区和工作目录都同步到你指定的提交 关于这个知识点，如果你还想再了解些其他的内容，我可以给你提供一个网址，没错，就是 它 。 3.既然我们提到了工作区和版本库，所以就有必要再总结下这俩东西 工作区的概念很简单，就是你本机上的那个文件夹，这个文件夹就是你的工作区，但是不包括其中的.git隐藏文件夹。 版本库就是我们刚才说的这个隐藏文件夹。 其实git的版本库里面有很多的内容，但是我们需要了解的就是其中最为重要的stage（或者index），学名叫做暂存区，此外，git还为我们自动创造了第一个branch，名为master，以及指向master的一个指针，叫做HEAD。 这时候我们就需要盗个图（来自廖雪峰的官方网站-git教程）来解释下他们的关系了。如下： 4.对了，其实有很多简单的操作也需要我们了解。 比如查看修改文件内容，创建删除文件啊之类的操作，其实这些东西大家自己去百度下就能找的到，而且肯定比博主说的详细， 这里 其实有一个网址，我感觉不错，推荐给大家。另外，这也有一个关于vi操作的网址推荐，拿走不蟹。 5.撤销修改 比如我们在工作区中选一个文件并对其进行修改，这时候我们发现，内容写错了，需要将版本回退到我们上次提交时的状态，使用git status命令查看当前状态，然后git就会告诉我们可以用git checkout – &lt; file &gt;来丢弃工作区的修改： $ git checkout – XXX.YYY 其实上面的命令有两种适用情况： （1）文件修改后尚未添加到暂存区，撤销之后就回到了与版本库一样的状态了。 （2）文件修改后我们又将其添加到了暂存区，这个时候我们并没有直接commit，而是又将文件做了新的修改，现在执行撤销修改命令后，文件就回到了添加到暂存区之后的状态了。 也就是说这个命令可以使文件回到最近一次git commit或者git add时的状态。 比如说你现在正处于第二种状态，通过git checkout – XXX.YYY命令已经将你写的第二次错误撤销了，但是你提交给暂存区的文件里仍存有你的第一次错误，所以你还需要将暂存区的文件再给撤销回来，此时同样使用git status命令查看下当前的状态，此时git会告诉你使用git reset HEAD file可以将暂存区的修改撤销掉（也就是以unstage结尾的那句话），并将其重新放回到工作区： $ git reset HEAD XXX.YYY 此时如果你用git status查看当前状态就会发现，changes not staged for commit，也就是说咱们的暂存区是干净的，但是工作区是有修改的，所以你可以再使用git checkout命令将你需要撤销的东西撤销了，或者直接手动修改文件，如果你记得需要改什么东西的话。 有灵性的同学可能又会问，我如果不仅git add了，而且git commit了，但是并没有将本地的版本库推送到远程，我们怎么办呢？其实很简单，版本回退不就好了~~~这时候可能又有有问题的同学举手说，我要是也将本地的版本库推送到了远程怎么办？额。。。我只能告诉你Good Game了，所以大家提交东西的时候一定要慎之又慎，尤其是推送到远端的时候。 6.文件删除。 这个就比较简单了，我们都知道在文件管理器中我们可以使用rm file命令就可以删除相应的文件，要是我们想删除版本库的某个文件怎么办？也很简单，使用git rm file就可以删除相应的文件，但是我们还需要再commit一下，告诉一下版本库我们的修改： $ git rm XXX.YYY $ git commit -m “romove balabala~~~~” 这样我们就完成了对版本库中的文件的删除操作。 如果你是不小心将工作区的文件删除了怎么办？这时候我们的版本库中仍然有相应的文件，我们只需要恢复下这个文件即可： $ git checkout – XXX.YYY git checkout 其实就是将版本库里的版本替换掉工作区的版本。这样你就获取到了版本库中最新的一次版本，但是你如果在XXX.YYY中已经修改了部分信息，而这部分信息也会随着你的误删丢失了，所以，小心看护你的工作区。 以上，是我对于廖神的git教程中时光机穿梭这一章的总结。","tags":[{"name":"学习心得","slug":"学习心得","permalink":"http://cliugeek9229.github.io/tags/学习心得/"}]},{"title":"git 学习总结（一）","date":"2017-06-20T14:27:37.000Z","path":"2017/06/20/git-学习总结/","text":"最近把廖神的git教程重温一遍，这篇博客主要是针对git中的命令，稍作总结。 1.博主的环境是win10，按照默认配置安装完git。之后，我们需要设置我们自己的用户名和默认的邮箱地址。 右键桌面，在出现的菜单中选择“Git Bash”选项，通过cd命令到达指定的文件夹下【或者你直接到指定的目目录下之后，然后右键空白处点击右键然后选择git bash here选项】，再通过键入以下命令完成设置： $ git config –global user.name “Leno” $ git config –global user.email “XXX@YYY.com” 注意下这里的–global参数，这个参数说明我们当前机器下的所有的git仓库都是用的这个用户名和邮箱。 2.创建版本库。 $ git init 3.分两步，将文件添加到git仓库。 3.1 将文件添加到暂存区（可多次添加文件，也可一次添加多个文件） $ git add XXX.YYY 3.2 将文件添提交到仓库 $ git commit -m “bala~bala~bala~” 4.查阅当前仓库的状态 $ git status 5.查阅文件具体被修改的内容 $ git diff XXX.YYY 6.查看从最近到最远的提交日志 $ git log 当然，这种显示日志简直low到炸，这时候我们可以通过一个参数添加达到让这些日志显示到一行上，具体命令如下： $ git log –pretty=oneline 这样显示出来的日志结果倒是简洁了不少，但是还不是令人特别满意，那么此时你可以试一下以下的这串命令： $ git log –color –graph –pretty=format:’%Cred%h%Creset -%C(yellow)%d%Creset %s %Cgreen(%cr) %C(bold blue)&lt;%an&gt;%Creset’ –abbrev-commit 这时候你会说，我不就是想看一下日志嘛，如果每次都输入这么一长串的命令，这样会耽误很长的时间，那岂不是很蠢。。。也对，每次都输入这么一长串命令确实斯丢屁德，那么怎么办呢，方法还是有的，既然你来访问我的博客，那你我就是有缘人，既然是有缘人，那我就不吝指教了。我们可以通过配置别名的方法来简化以上的这行命令，如下： $ git config –global alias.lg “log –color –graph –pretty=format:’%Cred%h%Creset -%C(yellow)%d%Creset %s %Cgreen(%cr) %C(bold blue)&lt;%an&gt;%Creset’ –abbrev-commit” 这样配置完之后，你再试一下： $ git lg 意不意外？惊不惊喜？高不高兴？关于配置别名在后边会又详细的叙述，今天就先到这。","tags":[{"name":"学习心得","slug":"学习心得","permalink":"http://cliugeek9229.github.io/tags/学习心得/"}]},{"title":"忙点好~忙点好~","date":"2017-06-16T11:58:20.000Z","path":"2017/06/16/忙点好-忙点好/","text":"这几天还真的是挺忙的，这样其实也挺充实的，最起码可以不让我老是窝宿舍。 其实这几天感触还是很多的，先是整理学籍表，自己忙了一天半还多，最让人心寒的是干活的时候叫人叫不来，回家的、去工作的我都能理解，大家其实都很忙，我真的能理解，但是，我最不能理解的就是装作没这回事的同学，还有因为在打游戏不能帮忙的，简直想送他们一句mmp。 毕竟大家在一起的日子也不是很多了，本来站好最后一班岗也是情理之中，但是大家对我们工作的支持态度也太差了，这个绝对是班委的预料之外的。。。 现在想想其实自己的问题也很大，做事不能太耿直，也不能一不顺心就摔脸子，这样不但不能解决问题，而且还会使得矛盾激化，以后可得好好收敛下自己的情绪了，不能想个小孩一样。 今天又被教务处抓去做了次壮丁，说好的只是核对班级的毕业信息，结果各种活都来了。。。先是去抱本科生的期末试卷，然后又是毕业证和学位证，可是累的不轻。 这几天虽然有些累，但总的来说，还是不错的。 现在洗脚听歌写博客也是很惬意的~~希望明天的六级考试能上300分吧，作为一名裸考考生，300我就已经很知足了【手动捂脸】","tags":[{"name":"随笔","slug":"随笔","permalink":"http://cliugeek9229.github.io/tags/随笔/"}]},{"title":"博客处女作","date":"2017-06-07T13:37:06.000Z","path":"2017/06/07/博客处女作/","text":"欢迎大家来到我的博客！在旭哥哥不懈地指导下，我的博客总算是搭建起来了。在这个博客上面我会不定期地发布个人随笔、读书笔记等。 去年冬天的时候就已经在廖雪峰的官方网站上学习过git的相关知识了，但仅仅只是学习一些基本的操作，并没有具体的将它用于项目中，结果就是感动了自己，浪费了时间，最后也没有学到多少东西，简直斯丢匹德。 学习其实不仅仅只是态度的问题，方法也很重要，以后这种感动自己的事还是不干的好… 本来想着关于技术博客也写在这个博客上，但是想到如果这样的话，无法供世人瞻仰，所以我准备把技术相关的博客写到CSDN上，这样的话，也是极好的。 现在这个写作水平啊，也是没谁了（手动无奈）。 最后还是欢迎大家常来我的博客逛一逛，当然，要是能顺便关爱一下博主就更好了（手动滑稽）。","tags":[{"name":"随笔","slug":"随笔","permalink":"http://cliugeek9229.github.io/tags/随笔/"}]}]